<!-- terraform-plan-comment -->
## Terraform Plan · `sandbox`

| Step | Status |
|------|--------|
| `fmt`      | ✅ |
| `init`     | ✅ |
| `validate` | ✅ |
| `plan`     | ✅ |

> ⚠️ **Plan: 4 to add · 0 to change · 0 to replace · 1 to destroy**

| Action | Resource |
|--------|----------|
| 🟢 create  | aws_eks_addon.pod_identity_agent |
| 🟢 create  | aws_eks_pod_identity_association.external_secrets |
| 🟢 create  | aws_iam_role.external_secrets |
| 🟢 create  | aws_iam_role_policy.external_secrets |
| 🔴 destroy | aws_secretsmanager_secret_version.app_api_key |

### 💰 Estimated cost
**$194.56 USD/month**

| Resource | Monthly cost |
|----------|-------------|
| module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] | $77.09 |
| module.eks.aws_eks_cluster.this[0] | $73.00 |
| module.vpc.aws_nat_gateway.this[0] | $43.07 |
| module.eks.module.kms.aws_kms_key.this[0] | $1.00 |
| aws_secretsmanager_secret.app_api_key | $0.40 |
<details>
<summary>Full plan output</summary>

```hcl
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/platform-engineering-sandbox/cluster]
aws_secretsmanager_secret.app_api_key: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-2:050752635151:secret:/sandbox/platform-engineering/admin-token-rOr9Pb]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08053e0117250399e]
aws_ecr_repository.app: Refreshing state... [id=platform-engineering-app]
aws_secretsmanager_secret_version.app_api_key: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-2:050752635151:secret:/sandbox/platform-engineering/admin-token-rOr9Pb|terraform-20260320072755980800000006]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_partition.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20260320072754923600000002]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=platform-engineering-sandbox-cluster-20260320072754930600000005]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=050752635151]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=050752635151]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::050752635151:assumed-role/github-oidc-role/github-actions-tf-plan]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20260320072754923600000002/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20260320072754923600000002/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20260320072754923600000002/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=platform-engineering-sandbox-cluster-20260320072754930600000005/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=164981592]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=1249f9ef-374d-497e-8a06-c40d04a2e8be]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/platform-engineering-sandbox]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::050752635151:policy/platform-engineering-sandbox-cluster-ClusterEncryption20260320072829115500000007]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=platform-engineering-sandbox-cluster-20260320072754930600000005/arn:aws:iam::050752635151:policy/platform-engineering-sandbox-cluster-ClusterEncryption20260320072829115500000007]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0dfbb9e81f6f9532f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01f751a6c4ddd8e07]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-05b685de464c920ae]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09e2cf799becc3c27]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c9b772d2537eda5f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f2f7d08bba9cd019]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ab7eb530f89d1241]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0440ce76487f2942b]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-07d299d0f91ac7940]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-001c2ceffd0695262]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f7e3d7db4004ceee]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0bb2f497423c7cf2b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09e20e4cc684e3db3]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03376ba0f9f68752e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03680acb74e2eb8aa]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09e2cf799becc3c271080289494]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2036308528]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-290355081]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3680018454]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3707779551]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3220804573]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2478843827]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2896539644]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4071645864]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3784873980]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1709688938]
module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"]: Refreshing state... [id=sgrule-621225970]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-980151580]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0788674f811efb6eb]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0256769988999b1c0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04c24810851600862]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e9e95825686e7bbd]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d49dfd1b8ad40d21]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02df9c6b38469c732]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04e78e35cd72900c5]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03376ba0f9f68752e1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=platform-engineering-sandbox]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=platform-engineering-sandbox:arn:aws:iam::050752635151:role/github-oidc-role]
module.eks.time_sleep.this[0]: Refreshing state... [id=2026-03-20T07:37:32Z]
module.eks.module.eks_managed_node_group["default"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=998843268579837466]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0ea68d6c0f22b5c2d]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=platform-engineering-sandbox#arn:aws:iam::050752635151:role/github-oidc-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=29d150171678eee0e01996f5fda9adfbe0b987d9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::050752635151:oidc-provider/oidc.eks.ap-southeast-2.amazonaws.com/id/46186282A3DE55DD2B014DAD23B20B88]
module.eks.module.eks_managed_node_group["default"].data.aws_ssm_parameter.ami[0]: Read complete after 1s [id=/aws/service/eks/optimized-ami/1.35/amazon-linux-2023/x86_64/standard/recommended/release_version]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=platform-engineering-sandbox:default-20260320120430905200000004]
aws_eks_addon.kube_proxy: Refreshing state... [id=platform-engineering-sandbox:kube-proxy]
aws_eks_addon.vpc_cni: Refreshing state... [id=platform-engineering-sandbox:vpc-cni]
aws_eks_addon.coredns: Refreshing state... [id=platform-engineering-sandbox:coredns]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_eks_addon.pod_identity_agent will be created
  + resource "aws_eks_addon" "pod_identity_agent" {
      + addon_name           = "eks-pod-identity-agent"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-engineering-sandbox"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "ap-southeast-2"
      + tags_all             = {
          + "environment" = "sandbox"
          + "managed-by"  = "terraform"
          + "project"     = "platform-engineering"
          + "team"        = "platform"
        }
    }

  # aws_eks_pod_identity_association.external_secrets will be created
  + resource "aws_eks_pod_identity_association" "external_secrets" {
      + association_arn      = (known after apply)
      + association_id       = (known after apply)
      + cluster_name         = "platform-engineering-sandbox"
      + disable_session_tags = false
      + external_id          = (known after apply)
      + id                   = (known after apply)
      + namespace            = "external-secrets"
      + region               = "ap-southeast-2"
      + role_arn             = (known after apply)
      + service_account      = "external-secrets"
      + tags_all             = {
          + "environment" = "sandbox"
          + "managed-by"  = "terraform"
          + "project"     = "platform-engineering"
          + "team"        = "platform"
        }
    }

  # aws_iam_role.external_secrets will be created
  + resource "aws_iam_role" "external_secrets" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-engineering-sandbox-external-secrets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "sandbox"
          + "managed-by"  = "terraform"
          + "project"     = "platform-engineering"
          + "team"        = "platform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.external_secrets will be created
  + resource "aws_iam_role_policy" "external_secrets" {
      + id          = (known after apply)
      + name        = "secrets-manager-read"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ap-southeast-2:050752635151:secret:/sandbox/platform-engineering/admin-token-rOr9Pb"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_secretsmanager_secret_version.app_api_key will be destroyed
  # (because aws_secretsmanager_secret_version.app_api_key is not in configuration)
  - resource "aws_secretsmanager_secret_version" "app_api_key" {
      - arn            = "arn:aws:secretsmanager:ap-southeast-2:050752635151:secret:/sandbox/platform-engineering/admin-token-rOr9Pb" -> null
      - id             = "arn:aws:secretsmanager:ap-southeast-2:050752635151:secret:/sandbox/platform-engineering/admin-token-rOr9Pb|terraform-20260320072755980800000006" -> null
      - region         = "ap-southeast-2" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-southeast-2:050752635151:secret:/sandbox/platform-engineering/admin-token-rOr9Pb" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20260320072755980800000006" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/vpc/vpc-flow-logs.tf line 28, in locals:
  28:     "arn:${data.aws_partition.current[0].partition}:logs:${data.aws_region.current[0].name}:${data.aws_caller_identity.current[0].account_id}:log-group:${log_group.name}:*"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)
Releasing state lock. This may take a few moments...

```
</details>

_@jordanjthomas · [View run](https://github.com/jordanjthomas/platform-engineering-sandbox/actions/runs/23400103243)_